/**
 * List of sentences to use in description.
 */
export const descriptionSource = [
  '平成時代を象徴する数々の災害から教訓を得て新しい時代を築き上げるという目標を「{{kanji}}」の字に込めた。',
  '「{{kanji}}」の字は画数が良いことから選ばれた。',
  '「{{kanji}}」の字は、グローバル化の時代の中で日本が誇る文化を世界に発信するという国家の使命を表している。',
  '世界の平和を願う想いを「{{kanji}}」という字に込めた。',
  '「{{kanji}}」という字には過労死の問題を新しい時代に持ち越さないという強い意思が込められている。',
  '技術大国日本を象徴する文字として「{{kanji}}」が使用されている。',
  '政府内における猫派と犬派の対立の様相が「{{kanji}}」の字から垣間見える。',
  'サービス業が隆盛を極めた平成の次の時代として、改めて第一次産業に力を入れたいという思いを「{{kanji}}」の字に込めた。',
  '富国強兵の目標を「{{kanji}}」の字に込めた。',
  '平成の大飢饉がもたらした甚大な被害を受けて、豊穣の神への祈りを表す「{{kanji}}」の字が採用された。',
  '平成の時代に環境問題に対する意識が高まったことを受けて、持続可能な社会の実現という国家の使命を表す「{{kanji}}」の字を取り入れた。',
  '日本の唯一無二の立ち位置を誇りとし、積極的に国際社会に参画するという目標が「{{kanji}}」という字に込められている。',
  '「{{kanji}}」という字からは次の時代に大きな変革をもらたすという強い意志が見て取れる。',
  '「{{kanji}}」の字はその造形の美しさが次の時代を表す元号にふさわしいと考えられた。',
  '平成の時代に確立された拝金主義の思想をますます推進することを目指して「{{kanji}}」の字を取り入れた。',
  '本年を真のバーチャル元年とすべく「{{kanji}}」の字を採用した。',
  '「{{kanji}}」の字はマイナンバーを国民に広く普及させるという国家の大目標を表している。',
  '「{{kanji}}」は国家の繁栄を表す文字として選ばれた。'
];

export const conjunctions = ['', 'そして、', 'また、', 'さらに、'];

export const sourceText = [
  '出典は『史記』および『書経』から。',
  '由来は『易経』の一節から。',
  '出典は『文選』。',
  '由来は『後漢書』及び『楽経』。',
  '出典は『宋書』から。',
  '出典は『新約聖書』。',
  '由来は『尚書』及び『漢書』。',
  '『春秋左氏伝』を由来とする。',
  '由来は『魏書』から。',
  '出典は『貞観政要』巻6。',
  '由来は『北堂書鈔』から。',
  '出典は『枕草子』。'
];

export const sourceNumber = descriptionSource.length;
export const conjunctionNumber = conjunctions.length;
export const sourceTextNumber = sourceText.length;
